aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
/* example of writing to FATFS on STM32 (STM32F103C8T6)
//
// to save the controllers step and reboot reading it from the file saved

   uses dyanmixel protocol
   
*/

#include "DKS_Common_F103xB.h"
#include "DKS_SPI_F103xB.h"
#include "DKS_Timer_F103xB.h"
#include "DKS_GPIO_F103xB.h"
#include "DKS_SD.h"
#include "DKS_F103C8T6.h"

#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_tim.h"
#include "stm32f4xx_hal.h"

#include <stdio>
#include <stdlib>
#include <string>

/* error from dynamixel */
typedef enum
{
    HWFail = 0x01,
    InstructionErr = 0x02,
    CRCError = 0x03,
    DataRangeErr = 0x04,
    DataLenErr = 0x05,
    DataLimitErr = 0x06,	
    DataAccessErr = 0x07
} DynamixelError_e; 
/*
    0	Current Control Mode DYNAMIXEL only controls current(torque) regardless of speed and position. This mode is ideal for a gripper or a system that only uses current(torque) control or a system that has additional velocity/position controllers.
    1	Velocity Control Mode This mode controls velocity. This mode is identical to the Wheel Mode(endless) from existing DYNAMIXEL. This mode is ideal for wheel-type robots.
    3   (Default) Position Control Mode	This mode controls position. This mode is identical to the Joint Mode from existing DYNAMIXEL. Operating position range is limited by the Max Position Limit(48) and the Min Position Limit(52). This mode is ideal for articulated robots that each joint rotates less than 360 degrees.
    4	Extended Position Control Mode(Multi-turn)	This mode controls position. This mode is identical to the Multi-turn Position Control from existing DYNAMIXEL. 512 turns are supported(-256[rev] ~ 256[rev]). This mode is ideal for multi-turn wrists or conveyer systems or a system that requires an additional reduction gear. Note that Max Position Limit(48), Min Position Limit(52) are not used on Extended Position Control Mode.
    5	Current-based Position Control Mode	This mode controls both position and current(torque). Up to 512 turns are supported(-256[rev] ~ 256[rev]). This mode is ideal for a system that requires both position and current control such as articulated robots or grippers.
    16	PWM Control Mode (Voltage Control Mode)
*/
typedef enum
{
    CurrentCtl = 0,
    VelocityCtl = 1,
    PositionCtl = 3,
    ExtPositionCtl = 4,
    CurrPositionCtl = 5,	
    PWMCtl = 16
} DynamixelCtlMode_e; 
		   
#define DS_TORQ_BIT 0x01u                               /* Torque On on startup (Torque Enable(64) is set to */
#define DS_BOOT_RAM_BIT 0x02u                           /* On startup, use the backup data to restore the RAM area. */

/* shutdown conf word */
#define VOLT_SHUT_BT 1u                                  
#define TEMP_SHUT_BT 4u
#define MTRENC_SHUT_BT 8u
#define SHOCK_SHUT_BT 16u
#define OVERLD_SHUT_BT 32u

/* define status return for all msgs */
#define PINGS_ONLY 0u
#define PINGS_AND_READS 1u
#define ALL_MESSAGES 2u

/* drive mode variables */
#define IG_TORQ_DM 0x08
#define TIME_PROFILE_DM 0x04                             /* set to time profile else its velocity profile */
#define REVERSE_MODE_DM 0x01

#define COM_DLY_DS 9u                                    /* set communication delay */
#define DRV_MODE_DS 10u                                  /* control param drive mode */
#define OP_MODE_DS 11u                                   /* control param operating mode */
#define HOMING_OFFSET_DS 20u                             /* control param homing offset */
#define MOVING_THRESH_DS 24u                             /* in motion 0-1023 */
#define OVERTEMP_THRESH_DS 31u                           /* shutdown if temp exceeds this 0-100 and Overheating Error Bit(0x04) is set */
#define MIN_VOLT_THRESH_DS 32u                           /* shutdown if volts under this 95-160 */
#define MAX_VOLT_THRESH_DS 34u                           /* shutdown if volts over this 95-160 */
#define WRITE_DS 60u                                     /* control param where dyanmixel start-up config is stored */
#define SHUTD_CONF_DS 63u
#define TORQUE_ENAB_DS 64u
#define STAT_RTN_DS 68u

#define GET_HW_STATUS 70u;

/* controller set-up */
#define VEL_CON_P_DS 78u
#define VEL_CON_I_DS 76u
#define POS_CON_P_DS 84u
#define POS_CON_I_DS 82u
#define POS_CON_D_DS 80u
#define POS_FF_G1_DS 90u
#define POS_FF_G2_DS 88u

#define BUS_WDOG_DS 98u                                   /* replies with  */
#define PWM_GOAL_DS 100u                                  /* pwm goal */
#define CURRENT_GOAL_DS 102u                              /* current goal */
#define VELO_GOAL_DS 104u                                 /* velocity goal */
#define POSN_GOAL_DS 116u                                 /* position goal */

#define PROFILE_ACC 108u                                  /* profile acceleration */
#define PROFILE_VEL 112u                                  /* profile velocity */

#define SENDDELAYCOUNT 500
#define RCVDELAYCOUNT 510

DKS::STM32F103C8T6 board(DKS::BlackPill);
//DKS::DigitalIn cd;
DKS::DigitalOut cs;
DKS::Ticker ticker;
DKS::SPI::SPI spi;

char write_buffer[_MAX_SS];
uint16_t step = 0;                                                              // default step for the seqyence
uint16_t sub_state = 0;

extern "C" void TIM3_IRQHandler()
{
    if (LL_TIM_IsActiveFlag_UPDATE(TIM3) == 1)
    {
        LL_TIM_ClearFlag_UPDATE(TIM3);
    }
    DKS::FatFs::disk_timerproc();
}

// set pwm output timers
TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

/* USART1 init function */
UART_HandleTypeDef huart1;

// encoder start
TIM_HandleTypeDef htim3;

/* timer interrupt every X seconds */
TIM_HandleTypeDef htim17;

int _index = 0;                                      /* receive index */
uint8_t RxData;
uint8_t RxBuff[20];                                  /* rcv buffer */
uint8_t TxDataIT[20];                                /* tx buffer */
uint8_t TxDataITMem[20];                             /* memory of tx buffer */
uint16_t Data1 = 116u;                               /* position */
uint16_t Data2 = 300u;                               /* value */
uint8_t id = 0x01u;			                         /* id ID1(XM430-W210)  */
uint8_t device_ping = 0;                             /* sets to 1 when ping is okay */
volatile uint8_t new_pos = 0;                        /* a tri-state for position == requesting a new position, read a new position, set the new position */
uint32_t position_readbk = 0;                        /* the position returned from a read back of the robotis dynamixel drive */
uint8_t re_trans1 = 0;                               /* flags to allow re-transmision for bad messages once */
uint8_t re_trans2 = 0;
uint8_t re_trans3 = 0;
uint16_t len_msg = 0u;                               /* msg len read back */
uint8_t inst = 0u;                                   /* instance */
uint8_t err = 0u;                                    /* error byte */

