aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
/* data for timed buffer flush */
uint32_t msgCnt = 0;
uint32_t lstMsgCnt = 0;
volatile uint8_t noActivityForTime = 0;	

/* -------------- function defs ---------------- */
void SystemClock_Config(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM17_Init(void);
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim);
void TIM17_IRQHandler(void);
void HAL_TIM_IRQHandler(TIM_HandleTypeDef *htim);
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef* htim_base);
void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef* htim_base);
void HAL_UART_MspInit(UART_HandleTypeDef* huart);
void HAL_UART_MspDeInit(UART_HandleTypeDef* huart);
static int USART1_UART_Init(void);
void user_tim1_pwm_setvalue(float value);
void user_tim2_pwm_setvalue(float value);
static void encoder_t3_start(void);
static int get_encoder_t3_value(void);
static void encoder_t2_start(void);
static int get_encoder_t2_value(void);
uint16_t update_dyn_crc(uint16_t crc_accum, unsigned char *data_blk_ptr, uint16_t data_blk_size);
void do_dynamixel_crc(unsigned char* TxPacket, uint16_t data_blk_size, uint8_t * crc_l, uint8_t * crc_h, uint8_t endian);
void write_dyna(uint16_t *Data1, uint16_t *Data2, uint8_t id);
void write_dyna_IT(uint16_t *Data1, uint16_t *Data2, uint8_t id);
void write_reg_dyna(uint16_t *Data1, uint16_t *Data2, uint8_t id);
void write_reg_dyna_IT(uint16_t *Data1, uint16_t *Data2, uint8_t id);
void factory_reset_dyna(uint8_t id);
void reboot_dyna(uint8_t id);
void ping_dyna(uint8_t id);
void ping_dyna_IT(uint8_t id);
void read_dyna_pos_IT(uint8_t id);
static int16_t isdigitanum(unsigned char ch);

int main(void)
{
        DKS::InitSystem();                                                  // initialise HAL and board
        board.Init();

        // Prepareing FatFs
        spi.Init(SPI1, 0, 0, 0);                                            // PA5: SCL, PA6: MISO, PA7: MOSI
        cs.Init(GPIOB, LL_GPIO_PIN_8, DKS::Push_Pull, DKS::Pull_Up);
        ticker.Init(TIM3, 1, DKS::TimeUnit_MilliSec);
        rtc.Init(DKS::Rtc_ClockSource_LSE);
        DKS::FatFs::SetEnv(&spi, &cs, &ticker, 0, 0);

        //Local variables
        FATFS FatFs;                                                          // Logical drive work area (file system object)
        FIL fil;                                                              // file object used when opening and closing the file
        FRESULT res;                                                          // result from the call
        const std::string fname = "test_the_write.txt";                       // the file used to check the write function on boot up
        const std::string fname2 = "sequence_data.txt";                       // the file we are writing and reading to save the step
        uint8_t writelen(0);
        char line[82];                                                        // read back of the line saved in the file
        std::string resMsg(line);

        // first check that we can read and write a test file correctly to check our FATFS 
        // Create File object
        res = f_mount(&FatFs, "", 0);
        if (res != FR_OK) return EXIT_FAILURE;
        res = f_open(&fil, fname.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
        if (res != FR_OK) return EXIT_FAILURE;

        // Write text
		sprintf(write_buffer, "step is = %d\r\n", step);
        writelen=f_puts(&write_buffer, &fil);
        if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
        res = f_close(&fil);
        if (res != FR_OK) return EXIT_FAILURE;

        // Read Test
        res = f_open(&fil, fname.c_str(), FA_READ);
        if (res != FR_OK) return EXIT_FAILURE;
        f_gets(line, sizeof(line) , &fil);
        res = f_close(&fil);
        if (res != FR_OK) return EXIT_FAILURE;

        // Confirm result if not ok FATFS not working
        std::string sndMsg(write_buffer);
        if (resMsg == sndMsg) nucleo.led->write(1);
        else return EXIT_FAILURE;

	    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
        HAL_Init();
        /* Configure the system clock */
        SystemClock_Config();

		GPIO_InitTypeDef GPIO_InitStruct = {0};
        __HAL_RCC_GPIOA_CLK_ENABLE();                              // GPIOA 
        GPIO_InitStruct.Pin = GPIO_PIN_5 / GPIO_PIN_4;             // Set both PIN5 and 4 at the same time
	    //GPIO_InitStruct.Pin = GPIO_PIN_ALL;                      set all 16 simulatenous
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;                        // Configure whether the GPIO is pulled up, pulled down, or not.
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;               // Set the operating frequency
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_6;             
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;                        // Configure whether the GPIO is pulled up, pulled down, or not.
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;               // Set the operating frequency
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	   
        GPIO_InitStruct.Pin = GPIO_PIN_7;             
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;                        // Configure whether the GPIO is pulled up, pulled down, or not.
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;               // Set the operating frequency
        HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	   
        /*Configure GPIO pin : Bit1_state_Pin */
        GPIO_InitStruct.Pin = GPIO_PIN_1;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(Bit1_state_GPIO_Port, &GPIO_InitStruct);

        GPIO_InitStruct.Pin = GPIO_PIN_2;
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(Bit1_state_GPIO_Port, &GPIO_InitStruct);
	   
        /*Configure GPIO pin : StateLED_Pin */
        GPIO_InitStruct.Pin = StateLED_Pin;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
        GPIO_InitStruct.Pull = GPIO_NOPULL;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
        HAL_GPIO_Init(StateLED_GPIO_Port, &GPIO_InitStruct);
  
        MX_TIM1_Init();                                             // initialise the timers for pwm and encoder
        MX_TIM2_Init();
        MX_TIM3_Init();

        MX_TIM17_Init();                                           /* interrupt timer */
        HAL_TIM_Base_Start_IT(&htim17);
		
        __HAL_RCC_GPIOB_CLK_ENABLE();
        if (USART1_UART_Init() == -1) return EXIT_FAILURE;
        //unsigned char uart1buf[100];
		HAL_UART_MspInit(&huart1);
		// enable UART1 Rx and Tx interrupts
        __HAL_UART_ENABLE_IT(&huart1, UART_IT_RXNE);
        __HAL_UART_ENABLE_IT(&huart1, UART_IT_TC);

        /* enable interrupt timer17 for buffer flush if no activity for 1 second on receive port */
        HAL_TIM_Base_MspInit(&htim17);
		
		// now read the saved step file if we have one otherwise default the step to zero
        if (f_open(&fil, fname2.c_str(), FA_READ) == FR_OK) {
            f_gets(line, sizeof(line) , &fil);
			unsigned char* token;
			uint16_t fieldNo=0u;
			unsigned char strField1[8u];                                               // field to contain the step number read from file
			token = strtok(&line, "="); 
			while (token != NULL)                                                       // read each delimetered field in the string
            {
              switch (fieldNo)
              {
                case 0u:                                                               // reads the first field
				{
					if (!strncmp(strField1,"step",4))                                  // its says step
                    {
                        token = strtok(NULL, ",");                                     // check for another comma
                        ++fieldNo;
					}
					else
					{
						token = NULL;                                                 // exit file is not containing the step
					}
				}
				break;
				
                case 1u:                                                              // reads the 2nd field
				{
                    sprintf( strField1,"%s\n", token );
                    if(isdigitanum(strField1[0u]))                                        // the 1st char was an ascii number then convert it
                    {
                       step = atoi(strField1);                                 
                    }
                    token = strtok(NULL, ",");                                         // check for another comma
                    ++fieldNo;
				}
                break;
				
				default:                                                               // got an errot with the value ignore at defaulted step
				{}
				break;
			  }
			}
			// close the file
			res = f_close(&fil);
            if (res != FR_OK) return EXIT_FAILURE;
		} 

