aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
        encoder_t3_start();	                                                                   /* encoder start */

        ping_dyna_IT(id);                                                                      // ping the dynamixel at the specified id to see if its communicating
        /* wait for ping success */
		
        uint16_t velocities[10] = { 276u, 267u, 300u, 140u, 200u, 50u, 10u, 310u, 110u, 40u };	/* list of velocities we set in the sequence */
        uint8_t v_cnt = 0;

        sub_state = 0;

        /*
		    set up for Dynamixel id 1 (XM430-W210) ref :- https://emanual.robotis.com/docs/en/dxl/x/xm430-w210/
		*/		
		while (sub_state <= 18) {                                  /* while all the config steps are not complete with status reply ok keep polling at the poll rate */
            switch (sub_state) {
                case 0:
			    {
                    Data1 = STAT_RTN_DS;                           /* define which messages return status */
                    Data2 = ALL_MESSAGES;                          /* set this to all */
                    id = 0x1u;			                           /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);             /* write to robotis dynamixel */	
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 1;                                                                     /* advance as we got the status back */
                        }
					}
                }
			    break;
		

		         case 1:
			    {
                    Data1 = WRITE_DS;                              /* write the start-up config */
                    Data2 = DS_BOOT_RAM_BIT | DS_TORQ_BIT;         /* torque on restore RAM from backup */
                    id = 0x1u;			                           /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);             /* write to robotis dynamixel */	
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 2;                                                                     /* advance as we got the status back */
                        } 
                    }						
                }
                break;
				
                case 2:
                {
                    /*
                        Operating Mode(11)
                        Value	Operating Mode	Description
                        0	Current Control Mode	DYNAMIXEL only controls current(torque) regardless of speed and position. This mode is ideal for a gripper or a system that only uses current(torque) control or a system that has additional velocity/position controllers.
                        1   	Velocity Control Mode	This mode controls velocity. This mode is identical to the Wheel Mode(endless) from existing DYNAMIXEL. This mode is ideal for wheel-type robots.
                        3(Default)	Position Control Mode	This mode controls position. This mode is identical to the Joint Mode from existing DYNAMIXEL. Operating position range is limited by the Max Position Limit(48) and the Min Position Limit(52). This mode is ideal for articulated robots that each joint rotates less than 360 degrees.
                        4	Extended Position Control Mode(Multi-turn)	This mode controls position. This mode is identical to the Multi-turn Position Control from existing DYNAMIXEL. 512 turns are supported(-256[rev] ~ 256[rev]). This mode is ideal for multi-turn wrists or conveyer systems or a system that requires an additional reduction gear. Note that Max Position Limit(48), Min Position Limit(52) are not used on Extended Position Control Mode.
                        5	Current-based Position Control Mode	This mode controls both position and current(torque). Up to 512 turns are supported(-256[rev] ~ 256[rev]). This mode is ideal for a system that requires both position and current control such as articulated robots or grippers.
                        16	PWM Control Mode (Voltage Control Mode)
                        */
                    Data1 = OP_MODE_DS;
                    Data2 = DynamixelCtlMode_e::PositionCtl;
                    id = 0x1u;			                           /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);             /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 3;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;				

                case 3:
                {					
                    /*
                     If the DYNAMIXEL receives an Instruction Packet, it will return the Status Packet after the time of the set Return Delay Time(9).
                     Note that the range of values is 0 to 254 (0XFE) and its unit is 2 [μsec]. For instance, if the Return Delay Time(9) is set to ‘10’, the Status Packet will be returned after 20[μsec] when the Instruction Packet is received.
                     Default value ‘250’(500[μsec]) units are 2 μsec
                     */
                    Data1 = COM_DLY_DS;
                    Data2 = 50u;                                    /* 100 μsec */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */	
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 4;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 4:
                {					
                    /* set up shutdown criterea 
                    The DYNAMIXEL can protect itself by detecting dangerous situations that could occur during the operation. Each Bit is inclusively processed with the ‘OR’ logic, therefore, multiple options can be generated. For instance, when ‘0x05’ (binary : 00000101) is defined in Shutdown(63), DYNAMIXEL can detect both Input Voltage Error(binary : 00000001) 
                    and Overheating Error(binary : 00000100). If those errors are detected, Torque Enable(64) is cleared to ‘0’ and the motor’s output becomes 0 [%].
                    REBOOT is the only method to reset Torque Enable(64) to ‘1’(Torque ON) after the shutdown.
                    Check Alert Bit(0x80) in an error field of Status Packet or a present status via Hardware Error Status(70). The followings are detectable situations
                    */
                    Data1 = OVERTEMP_THRESH_DS;
                    Data2 = 75u;                                    /* if temp over 75 degrees shutdown and turn torque off */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 4;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 4:
                {					
                    Data1 = MIN_VOLT_THRESH_DS;
                    Data2 = 105u;                                    /* min vlts */
                    id = 0x1u;			                             /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);               /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 5;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 5:
                {				
                    Data1 = MAX_VOLT_THRESH_DS;
                    Data2 = 150u;                                    /* max vlts */
                    id = 0x1u;			                             /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);               /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 6;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

