aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
                case 6:
                {					
                    Data1 = SHUTD_CONF_DS;                                                                         /* configure shutdown mode on error (trip) */
                    Data2 = VOLT_SHUT_BT | TEMP_SHUT_BT | MTRENC_SHUT_BT | SHOCK_SHUT_BT | OVERLD_SHUT_BT;         /* configure the shutdown word */
                    id = 0x1u;			                                                                           /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);                                                             /* write to robotis dynamixel */	
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                                 /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {                  /* check a set packet was received and hanshaked correctly */
                            sub_state = 7;                                                                         /* advance as we got the status back */
                        }
                    }
                }
                break;		

                case 7:
                {				
                    /* velocity PI controller set-up */
                    Data1 = VEL_CON_P_DS;                           /* proportional band */
                    Data2 = 7000u;                                  /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 8;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;	

                case 8:
                {					
                    Data1 = VEL_CON_I_DS;                           /* integral time */
                    Data2 = 100u;                                   /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {              /* check a set packet was received and hanshaked correctly */
                            sub_state = 9;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 9:
                {					
                    /* position PID with feedfoward gain controller set-up */
                    Data1 = POS_CON_P_DS;                           /* proportional band */
                    Data2 = 6000u;                                  /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 10;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 10:
                {				
                    Data1 = POS_CON_I_DS;                           /* integral time */
                    Data2 = 200u;                                   /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 11;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 11:
                {					
                    Data1 = POS_CON_D_DS;                           /* derivative term */
                    Data2 = 10u;                                    /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 12;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

