aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
                case 12:
                {				
                    Data1 = POS_FF_G1_DS;                           /* feedforward gain 1 */
                    Data2 = 1000u;                                   /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 13;                                                                     /* advance as we got the status back */
                        }
                    }						
                }
                break;

                case 13:
                {					
                    Data1 = POS_FF_G2_DS;                           /* feedforward gain 2 */
                    Data2 = 890u;                                   /* 0-16383 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 14;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 14:
                {					
                    Data1 = BUS_WDOG_DS;                            /* bus wtachdog */
                    Data2 = 0u;                                     /* clear wdog */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */	
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 15;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 15:
                {					
                    Data1 = DRV_MODE_DS;                            /* set drive mode */
                    Data2 = TIME_PROFILE_DM | IG_TORQ_DM;           /* ignore torque on do action adn time profile not velocity is chosen */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 16;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 16:
                {					
                    Data1 = PROFILE_ACC;                            /* profile acceleration */
                    Data2 = 7000;                                   /* range 0 ~ 3276 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 17;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 17:
                {					
                    Data1 = PROFILE_VEL;                            /* profile acceleration */
                    Data2 = 6000;                                   /* range 0 ~ 3276 */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 18;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                case 18:
                {					
                    Data1 = TORQUE_ENAB_DS;                         /* torque enable */
                    Data2 = 1u;                                     /* on */
                    id = 0x1u;			                            /* id ID1(XM430-W210)  */	  
                    write_dyna_IT(&Data1, &Data2, id);              /* write via robotis dynamixel control protocol */	
					for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
                        if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {               /* check a set packet was received and hanshaked correctly */
                            sub_state = 19;                                                                     /* advance as we got the status back */
                        }
                    }
                }
                break;

                default:
                {
                    sub_state = 19;
                }
                break;
            }
            HAL_Delay(1000);                                         /* poll interval */			
        }
		
        // do the state engine for the robot here.......	
        while(1) {  
           /* USER CODE BEGIN 3 */    
		   switch(step) {
               case 0:
               {
                  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5); 
				  if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_RESET)                   // pin1 off set pin 3 otherwise unset pin3
                  {
                      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
                  }
                  else
                  {
                     HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
                  }		
                  user_tim1_pwm_setvalue(10.0f);	
                  user_tim2_pwm_setvalue(40.0f);
				  if (device_ping == 1) {
                      Data1 = POSN_GOAL_DS;                                                         /* initial goal position */
                      Data2 = 300u;                                                                 /* init value of position */
                      id = 0x1u;			                                                        /* id ID1(XM430-W210)  */	  
				      write_dyna_IT(&Data1, &Data2, id);                                            /* write to robotis dynamixel */
                  }
                  // a simple msg transmission example HAL_UART_Transmit( &huart1, uart1buf, strlen(uart1buf) + 1, 0xFFFF);	
				  
