aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
				  // save the step to the FATFs for recall on reboot
                  res = f_open(&fil, fname2.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
                  if (res != FR_OK) return EXIT_FAILURE;
		          sprintf(write_buffer, "step = %d\r\n", step+1);
                  writelen=f_puts(&write_buffer, &fil);
                  if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
                  res = f_close(&fil);
                  if (res != FR_OK) return EXIT_FAILURE;
                  HAL_Delay(1000);
				  ++step;
               }
			   break;
			   
               case 1:
               {
                  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_7); 
				  if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_2) == GPIO_PIN_SET)
                  {
                      HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
                  }
                  else
                  {
                     HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
                  }	
		          if (get_encoder_t3_value() > 80)
                  {
                      user_tim1_pwm_setvalue(5.0f);	
			      } else {
                      user_tim1_pwm_setvalue(15.0f);						  
				  }					  
				  // save the step to the FATFs for recall on reboot
                  res = f_open(&fil, fname2.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
                  if (res != FR_OK) return EXIT_FAILURE;
		          sprintf(write_buffer, "step = %d\r\n", step+1);
                  writelen=f_puts(&write_buffer, &fil);
                  if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
                  res = f_close(&fil);
                  if (res != FR_OK) return EXIT_FAILURE;
                  HAL_Delay(1000);
				  
				  ++step;
               }
			   break;

               case 2:
               {
				  user_tim2_pwm_setvalue(70.0f);	
                  if (device_ping == 1) {
					  new_pos = 0;                                    /* reset position read status to reading */
					  read_dyna_pos_IT(id);                           /* send out a read of position for device id 1 and wait until interrupt has set the flag to say it has been read */
                      if (new_pos == 1) {                             /* ready we read the new position */
                          Data1 = POSN_GOAL_DS;                       /* goal position */
                          Data2 = (position_readbk + 100u) % 4095u;   /* value */
                          id = 0x1u;			                      /* id ID1(XM430-W210)  */	  
				          write_dyna_IT(&Data1, &Data2, id);
					      for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
						      if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {            /* check a set packet was received and hanshaked correctly */
						          new_pos = 2;                                                                     /* advance as we got the status back */
                              }
                          }							  
                      }
                  } else {
                     new_pos = 2;                                     /* no drive then just step forwards with the sequence */
                  }					 
				  if (new_pos == 2 ) {                                /* we completed setting the position on the dynamixel or we skipped it */
				      // save the step to the FATFs for recall on reboot
                      res = f_open(&fil, fname2.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
                      if (res != FR_OK) return EXIT_FAILURE;
		              sprintf(write_buffer, "step = %d\r\n", step+1);
                      writelen=f_puts(&write_buffer, &fil);
                      if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
                      res = f_close(&fil);
                      if (res != FR_OK) return EXIT_FAILURE;
                      HAL_Delay(1000);
                      new_pos = 0;	
					  
				      ++step;
                  }
               }
               break;

              case 3:
               {	
                  if (device_ping == 1) {
					  new_pos = 0;                                    /* reset position read status to reading */
					  read_dyna_pos_IT(id);
                      if (new_pos == 1) {                             /* ready we read the new position read from the interrupt */
                          Data1 = POSN_GOAL_DS;                       /* goal position */
                          Data2 = (position_readbk + 100u) % 4095u;   /* value */
                          id = 0x1u;			                      /* id ID1(XM430-W210)  */	  
				          write_dyna_IT(&Data1, &Data2, id);
					      for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
						      if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {
						          new_pos = 2;
                              }
                          }
                      }
                  } else {
                     new_pos = 2;                                     /* no drive then just step forwards */
                  }					 
				  if (new_pos == 2 ) {
				      // save the step to the FATFs for recall on reboot
                      res = f_open(&fil, fname2.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
                      if (res != FR_OK) return EXIT_FAILURE;
		              sprintf(write_buffer, "step = %d\r\n", step+1);
                      writelen=f_puts(&write_buffer, &fil);
                      if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
                      res = f_close(&fil);
                      if (res != FR_OK) return EXIT_FAILURE;
                      HAL_Delay(1000);
                      new_pos = 0;	
					  
