aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
				      ++step;
                  }
               }
               break;

              case 4:
               {	
                  if (device_ping == 1) {
					  new_pos = 0;                                    /* reset position read status to reading */
					  read_dyna_pos_IT(id);                           /* send UART message to read position from duanmixel id as passed to this function */
                      if (new_pos == 1) {                             /* ready we read the new position */
                          Data1 = POSN_GOAL_DS;                       /* goal position */
                          Data2 = (position_readbk + 100u) % 4095u;   /* value */
                          id = 0x1u;			                      /* id ID1(XM430-W210)  */	  
				          write_dyna_IT(&Data1, &Data2, id);          /* send UART message to write position to duanmixel id as passed to this function */
					      for (int k=0; k < (3*SENDDELAYCOUNT)+(3*RCVDELAYCOUNT); k++) {                             /* wait for a delay of send and receive buffer will send if error msg returned */
						      if (HAL_GPIO_ReadPin(StateLED_GPIO_Port, StateLED_Pin) == GPIO_PIN_SET) {
						          new_pos = 2;
                              }
                          }
                      }
                  } else {
                     new_pos = 2;                                     /* no drive then just step forwards */
                  }					 
				  if (new_pos == 2 ) {
				      // save the step to the FATFs for recall on reboot
                      res = f_open(&fil, fname2.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
                      if (res != FR_OK) return EXIT_FAILURE;
		              sprintf(write_buffer, "step = %d\r\n", step+1);
                      writelen=f_puts(&write_buffer, &fil);
                      if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
                      res = f_close(&fil);
                      if (res != FR_OK) return EXIT_FAILURE;
                      HAL_Delay(1000);
                      new_pos = 0;	                                    /* reset the read flag on the position as it was used */
					  
				      ++step;
                  }
               }
               break;
			   
               case 5:
               {
                  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_6); 
                  user_tim1_pwm_setvalue(0.503f);		
                  if (device_ping == 1) {
                      Data1 = TORQUE_ENAB_DS;                             /* torque disable to change operating mode */
                      Data2 = 0u;                                         /* off */
                      id = 0x1u;			                              /* id ID1(XM430-W210)  */	  
                      write_dyna_IT(&Data1, &Data2, id);                  /* write via robotis dynamixel control protocol */
                      Data1 = OP_MODE_DS;                                 /* change mode to velocity control  */
                      Data2 = DynamixelCtlMode_e::VelocityCtl;
                      id = 0x1u;			                              /* id ID1(XM430-W210)  */	  
                      write_dyna_IT(&Data1, &Data2, id);                  /* write via robotis dynamixel control protocol */
					  HAL_Delay(10);
                      Data1 = VELO_GOAL_DS;                               /* goal velocity */
                      Data2 = velocities[v_cnt];                          /* value */
					  v_cnt = (v_cnt + 1) % 10;                           /* choose the next value */
					  /* v_cnt = (v_cnt + 1) % (uint8_t) sizeof(velocities);    choose the next value */
                      id = 0x1u;			                              /* id ID1(XM430-W210)  */	  
				      write_reg_dyna_IT(&Data1, &Data2, id);
                      Data1 = TORQUE_ENAB_DS;                             /* torque enable */
                      Data2 = 1u;                                         /* on */
                      id = 0x1u;			                              /* id ID1(XM430-W210)  */	  
                      write_dyna_IT(&Data1, &Data2, id);                  /* write via robotis dynamixel control protocol */
                  }				  
				  /* save the step to the FATFs for recall on reboot */
                  res = f_open(&fil, fname2.c_str() , FA_CREATE_ALWAYS | FA_WRITE);
                  if (res != FR_OK) return EXIT_FAILURE;
		          sprintf(write_buffer, "step = %d\r\n", step+1);
                  writelen=f_puts(&write_buffer, &fil);
                  if (writelen != strlen(&write_buffer)) return EXIT_FAILURE;
                  res = f_close(&fil);
                  if (res != FR_OK) return EXIT_FAILURE;
                  HAL_Delay(1000);
				  
				  ++step;
               }
			   break;

               case 6:
               {
                  if (device_ping == 0) {                         /* try re-pinging dynamixel if it is offline to poll table */
                      ping_dyna_IT(id); 					  
                  }				  
                  step = 0;                                      /* set the step back to the start again */
               }
               break;
			   
			   default:
			   {
                  step = 0;
			   }
			   break;
           }
		   HAL_Delay(1000);
		}
}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_TIM1;
  PeriphClkInit.Tim1ClockSelection = RCC_TIM1CLK_HCLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* TIM1 init function */
static void MX_TIM1_Init(void)
{

  TIM_Encoder_InitTypeDef sConfig;
  TIM_MasterConfigTypeDef sMasterConfig;

  htim1.Instance = TIM1;
  htim1.Init.Prescaler = 0;
  htim1.Init.CounterMode = TIM_COUNTERMODE_UP;
  htim1.Init.Period = 65535;
  htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;
  sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
  sConfig.IC1Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC1Filter = 0;
  sConfig.IC2Polarity = TIM_ICPOLARITY_RISING;
  sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
  sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
  sConfig.IC2Filter = 0;
  if (HAL_TIM_Encoder_Init(&htim1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }

