aircampro/Pi_armadillo/plc_robot_coms/Robotis/STM32/stm32_step_save.c
// goal pos Data1 116 value Data2 e.g. 512
void write_dyna(uint16_t *Data1, uint16_t *Data2, uint8_t id)
{
	int i;
	volatile int j;
	uint8_t TxData[13];
	uint8_t crcl = 0;
	uint8_t crch = 0;
	TxData[0] = 0xFF;
	TxData[1] = 0xFF;
	TxData[2] = 0xFD;
	TxData[3] = 0x00;
	TxData[4] = id;
	TxData[5] = 0x09;
	TxData[6] = 0x00;
	TxData[7] = 0x03;                                     // write
	TxData[8] = 0x00;
	TxData[9] = Data1[0];
	TxData[10] = Data1[1];
	TxData[11] = Data2[0];
	TxData[12] = Data2[1];
	TxData[13] = Data2[2];
	TxData[14] = Data2[3];
    do_dynamixel_crc(&TxData, 11u, &crcl, &crch, 0);
	TxData[15] = crcl;
	TxData[16] = crch;
	HAL_UART_Transmit(&huart1,TxData,17,1);            
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
// goal pos Data1 116 value Data2 e.g. 512 using interrupt
void write_dyna_IT(uint16_t *Data1, uint16_t *Data2, uint8_t id)
{
	int i;
	volatile int j;
	uint8_t crcl = 0;
	uint8_t crch = 0;
	HAL_GPIO_WritePin(StateLED_GPIO_Port, StateLED_Pin, GPIO_PIN_RESET);
	TxDataIT[0] = 0xFF;
	TxDataIT[1] = 0xFF;
	TxDataIT[2] = 0xFD;
	TxDataIT[3] = 0x00;
	TxDataIT[4] = id;
	TxDataIT[5] = 0x09;
	TxDataIT[6] = 0x00;
	TxDataIT[7] = 0x03;                                     // write
	TxDataIT[8] = 0x00;
	TxDataIT[9] = Data1[0];
	TxDataIT[10] = Data1[1];
	TxDataIT[11] = Data2[0];
	TxDataIT[12] = Data2[1];
	TxDataIT[13] = Data2[2];
	TxDataIT[14] = Data2[3];
    do_dynamixel_crc(&TxDataIT, 11u, &crcl, &crch, 0);
	TxDataIT[15] = crcl;
	TxDataIT[16] = crch;
	HAL_UART_Transmit_IT(&huart1,TxDataIT,17,1);            
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
// goal velocity Data1 104 value Data2 e,g, 200
void write_reg_dyna(uint16_t *Data1, uint16_t *Data2, uint8_t id)
{
	int i;
	volatile int j;
	uint8_t TxData[13];
	uint8_t crcl = 0;
	uint8_t crch = 0;
	TxData[0] = 0xFF;
	TxData[1] = 0xFF;
	TxData[2] = 0xFD;
	TxData[3] = 0x00;
	TxData[4] = id;
	TxData[5] = 0x09;
	TxData[6] = 0x00;
	TxData[7] = 0x04;                                     // write reg
	TxData[8] = 0x00;
	TxData[9] = Data1[0];
	TxData[10] = Data1[1];
	TxData[11] = Data2[0];
	TxData[12] = Data2[1];
	TxData[13] = Data2[2];
	TxData[14] = Data2[3];
    do_dynamixel_crc(&TxData, 11u, &crcl, &crch, 0);
	TxData[15] = crcl;
	TxData[16] = crch;
	HAL_UART_Transmit(&huart1,TxData,17u,1);
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
void write_reg_dyna_IT(uint16_t *Data1, uint16_t *Data2, uint8_t id)
{
	int i;
	volatile int j;
	uint8_t crcl = 0;
	uint8_t crch = 0;
	HAL_GPIO_WritePin(StateLED_GPIO_Port, StateLED_Pin, GPIO_PIN_RESET);
	TxDataIT[0] = 0xFF;
	TxDataIT[1] = 0xFF;
	TxDataIT[2] = 0xFD;
	TxDataIT[3] = 0x00;
	TxDataIT[4] = id;
	TxDataIT[5] = 0x09;
	TxDataIT[6] = 0x00;
	TxDataIT[7] = 0x04;                                     // write reg
	TxDataIT[8] = 0x00;
	TxDataIT[9] = Data1[0];
	TxDataIT[10] = Data1[1];
	TxDataIT[11] = Data2[0];
	TxDataIT[12] = Data2[1];
	TxDataIT[13] = Data2[2];
	TxDataIT[14] = Data2[3];
    do_dynamixel_crc(&TxDataIT, 11u, &crcl, &crch, 0);
	TxDataIT[15] = crcl;
	TxDataIT[16] = crch;
	HAL_UART_Transmit_IT(&huart1,TxDataIT,17u,1);            
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
void factory_reset_dyna(uint8_t id)
{
	int i;
	volatile int j;
	uint8_t TxData[11];
	uint8_t crcl = 0;
	uint8_t crch = 0;
	TxData[0] = 0xFF;
	TxData[1] = 0xFF;
	TxData[2] = 0xFD;
	TxData[3] = 0x00;
	TxData[4] = id;
	TxData[5] = 0x04;
	TxData[6] = 0x00;
	TxData[7] = 0x06;                                     // fr
	TxData[8] = 0x01;
    do_dynamixel_crc(&TxData, 9u, &crcl, &crch, 0);
	TxData[9] = crcl;
	TxData[10] = crch;
	HAL_UART_Transmit(&huart1,TxData,11,1);
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
void reboot_dyna(uint8_t id)
{
	int i;
	volatile int j;
	uint8_t TxData[10];
	uint8_t crcl = 0;
	uint8_t crch = 0;
	TxData[0] = 0xFF;
	TxData[1] = 0xFF;
	TxData[2] = 0xFD;
	TxData[3] = 0x00;
	TxData[4] = id;
	TxData[5] = 0x04;
	TxData[6] = 0x00;
	TxData[7] = 0x08;                                     // reboot
	TxData[8] = 0x2F;
    do_dynamixel_crc(&TxData, 9u, &crcl, &crch, 0);
	TxData[10] = crcl;
	TxData[11] = crch;
	HAL_UART_Transmit(&huart1,TxData,12,1);
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
void ping_dyna(uint8_t id)
{
	int i;
	volatile int j;
	uint8_t TxData[9];
	uint8_t crcl = 0;
	uint8_t crch = 0;
	TxData[0] = 0xFF;
	TxData[1] = 0xFF;
	TxData[2] = 0xFD;
	TxData[3] = 0x00;
	TxData[4] = id;
	TxData[5] = 0x03;
	TxData[6] = 0x00;
	TxData[7] = 0x01;                                     // reboot
    do_dynamixel_crc(&TxData, 8u, &crcl, &crch, 0);
	TxData[10] = crcl;
	TxData[11] = crch;
	HAL_UART_Transmit(&huart1,TxData,12,1);
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
void ping_dyna_IT(uint8_t id)
{
	int i;
	volatile int j;
	uint8_t crcl = 0;
	uint8_t crch = 0;
	TxDataIT[0] = 0xFF;
	TxDataIT[1] = 0xFF;
	TxDataIT[2] = 0xFD;
	TxDataIT[3] = 0x00;
	TxDataIT[4] = id;
	TxDataIT[5] = 0x03;
	TxDataIT[6] = 0x00;
	TxDataIT[7] = 0x01;                                     // reboot
    do_dynamixel_crc(&TxDataIT, 8u, &crcl, &crch, 0);
	TxDataIT[10] = crcl;
	TxDataIT[11] = crch;
	HAL_UART_Transmit_IT(&huart1,TxDataIT,10u,1);
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
// read the current position
void read_dyna_pos_IT(uint8_t id)
{
	int i;
	volatile int j;
	uint8_t crcl = 0;
	uint8_t crch = 0;
	new_pos = 0;
	TxDataIT[0] = 0xFF;
	TxDataIT[1] = 0xFF;
	TxDataIT[2] = 0xFD;
	TxDataIT[3] = 0x00;
	TxDataIT[4] = id;
	TxDataIT[5] = 0x07;
	TxDataIT[6] = 0x00;
	TxDataIT[7] = 0x02;                                     // read
	TxDataIT[8] = 0x00;
	TxDataIT[9] = 0x84;
	TxDataIT[10] = 0x00;
	TxDataIT[11] = 0x04;
	TxDataIT[12] = 0x00;
    do_dynamixel_crc(&TxDataIT, 11u, &crcl, &crch, 0);
	TxDataIT[13] = crcl;
	TxDataIT[14] = crch;
	HAL_UART_Transmit_IT(&huart1,TxDataIT,15u,1);            
	//HAL_Delay(1);
	for(j=0;j<SENDDELAYCOUNT;j++);
}
/* check if the char is a numerical digit */
static int16_t isdigitanum(unsigned char ch) 
{
  return ch >= '0' && ch <= '9';
}

/*--- Interrupt for UART1 rcv buffer Robotis Dyanmixel protocol ---*/
#define FULL_STAT_MSG_LEN 11
#define FULL_PINGBACK_MSG_LEN 14
#define FULL_READBK_MSG_LEN 15
#define STAT_HEADER_LEN 5
#define POS_SET_MSG_LEN 17
#define POS_RD_MSG_LEN 14
#define PING_MSG_LEN 10
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *UartHandle){}
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
    volatile int j=0;
    HAL_UART_Receive_IT(&huart1, &RxData, 1);
	msgCnt = (msgCnt+1) % UINT32_MAX;                                                                                            /* count when we are receiving chars */
	if (noActivityForTime == 1) {                                                                                                /* receive buffer timeout occurred */
        _index = 0;                                                                                                              /* reset the buffer pointer as message must be discarded no activity within timeout */
		noActivityForTime = 0;
    }		
	uint8_t Data = RxData;                                                                                                       // interrupt receive byte
			
	if(_index >= (STAT_HEADER_LEN+1)){                                                                                            // we just saw a valid header in the buffer so start collection
		RxBuff[_index-1] = Data;
		_index++;
		if(_index == STAT_HEADER_LEN+4) {                                                                                       /* we have collected the next part of the message */
            len_msg = (RxBuff[STAT_HEADER_LEN+1] << 8) | RxBuff[STAT_HEADER_LEN];                                               /* length */
            inst = RxBuff[STAT_HEADER_LEN+2];                                                                                   /* instance */
            err = RxBuff[STAT_HEADER_LEN+3];			                                                                        /* error byte */
        }
		if(_index == FULL_STAT_MSG_LEN) {                                                                                        // full message was received
			if ((len_msg == 4) && (inst == 0x55)) {                                                                              // it is a status message from a write or write reg command
			    _index = 0;                                                                                                // re-start receive collection
				uint8_t crc1, crch;
                do_dynamixel_crc(&RxBuff, 9, &crcl, &crch, 0);
                if ((crcl == RxBuff[STAT_HEADER_LEN+4]) && (crcl == RxBuff[STAT_HEADER_LEN+5])) {                                 // crc matches
					if (err != 0) {
						if (err == DynamixelError_e::CRCError) {                                                                  // error was with the transmitted crc
                            HAL_UART_Transmit_IT(&huart1, TxDataIT, POS_SET_MSG_LEN, 1);                                          // retransmit
                        } else if (err == DynamixelError_e::DataRangeErr) { 						                              // DataRangeErr is sent upon a watchdog failure
						    memcpy(&TxDataITMem,&TxDataIT,20);                                                                    // remember what we are sending
                            Data1 = BUS_WDOG_DS;                                                                                  /* set bus watchdog */
                            Data2 = 0u;                                                                                           /* clear the wdog */
                            id = 0x1u;			                                                                                  /* id ID1(XM430-W210)  */	  
                            write_dyna_IT(&Data1, &Data2, id);                                                                    /* write via robotis dynamixel control protocol */
                            HAL_UART_Transmit_IT(&huart1, TxDataITMem, POS_SET_MSG_LEN, 1);                                       // retransmit							
                        } else {                                                                                                  // malformed message transmitted
                            if (re_trans1 == 0u) {                                                                                // try the packet once more
                               HAL_UART_Transmit_IT(&huart1, TxDataIT, POS_SET_MSG_LEN, 1);
                               re_trans1 = 1;
                            } else {                                                                                               // twice same error
                               re_trans1 = 0;
                        	}
						}
                        HAL_GPIO_WritePin(StateLED_GPIO_Port, StateLED_Pin, GPIO_PIN_RESET);	                                   // led off means we have an error with the transmit packet					
					} else {
                        HAL_GPIO_WritePin(StateLED_GPIO_Port, StateLED_Pin, GPIO_PIN_SET);                                         // ack that we wrote correctly to the drive
                    }						
                } else {
                    HAL_UART_Transmit_IT(&huart1, TxDataIT, POS_SET_MSG_LEN, 1);                                                    /* retransmit */	
                    HAL_GPIO_WritePin(StateLED_GPIO_Port, StateLED_Pin, GPIO_PIN_RESET);					
                }				
			} else {
                /* search the buffer for a new start transmission and move the message if found becasue it was a partial message overlapped  */
				for (int z=STAT_HEADER_LEN+1; z < (FULL_STAT_MSG_LEN-STAT_HEADER_LEN); z++) {                                          /* parse the buffer without the header */
			        if (((RxBuff[z]==0xFF && RxBuff[z+1]==0xFF) && (RxBuff[z+2]==0xFD && RxBuff[z+3]==0x00)) && (RxBuff[z+4]==id)) {   /* check for another header (message partial) */
                        for (int x=z; x <= (FULL_STAT_MSG_LEN-1); x++) {                                                               /* for the remaining message */
                            RxBuff[x-z] = RxBuff[x];                                                                                   /* move the buffer up */                                  
                        }
						_index = (x-z)+1;                                                                                              /* set the index to the end of this new message */
						break;                                                                                                         /* exit the parse loop */
                    }						
                }
            }
		}
		if(_index == FULL_PINGBACK_MSG_LEN) {                                                                                      // full message was received
			if ((len_msg == 7) && (inst == 0x55)) {                                                                                // it is a ping reply message
                _index = 0;                                                                                               /* reset the collector as we got a good msg */
				uint8_t crc1, crch;
                do_dynamixel_crc(&RxBuff, 12, &crcl, &crch, 0);
                if ((crcl == RxBuff[STAT_HEADER_LEN+8]) && (crcl == RxBuff[STAT_HEADER_LEN+9])) {                                  // crc matches
					if (err != 0) {
                        device_ping = 0;	
						if (err == DynamixelError_e::CRCError) {                                                                  // error was with the transmitted crc
                            ping_dyna_IT(id);                                                                                     // retransmit					
                        } else {                                                                                                  // malformed message transmitted
                            if (re_trans2 == 0u) {                                                                                 // try the packet once more
                               ping_dyna_IT(id);
                               re_trans2 = 1;
                            } else {                                                                                               // twice same error
                               re_trans2 = 0;
                        	}						   
                        }							
					} else {
                        device_ping = 1;
                    }						
                } else {
                    //HAL_UART_Transmit_IT(&huart1, TxDataIT, 12u, 1);                                                            // retransmit	
                    ping_dyna_IT(id);
                    device_ping = 0;					
                }				
			} else {
                /* search the buffer for a new start transmission and move the message if found */
				for (int z=STAT_HEADER_LEN+1; z < (FULL_PINGBACK_MSG_LEN-STAT_HEADER_LEN); z++) {                                          /* parse the buffer without the header */
			        if (((RxBuff[z]==0xFF && RxBuff[z+1]==0xFF) && (RxBuff[z+2]==0xFD && RxBuff[z+3]==0x00)) && (RxBuff[z+4]==id)) {       /* check for another header (message partial) */
                        for (int x=z; x <= (FULL_PINGBACK_MSG_LEN-1); x++) {                                                               /* for the remaining message */
                            RxBuff[x-z] = RxBuff[x];                                                                                       /* move the buffer up */                                  
                        }
						_index = (x-z)+1;                                                                                                  /* set the index to the end of this new message */
						break;                                                                                                             /* exit the parse loop */
                    }						
                }
            }
		}
		if(_index == FULL_READBK_MSG_LEN) {                                                                                        // full message was received (longest it resets collection if invalid)
			if ((len_msg == 8) && (inst == 0x55)) {                                                                                // it is a position read reply message
			    _index = 0;                                                                                                            /* reset collector on longest possible message receive */
				uint8_t crc1, crch;
                do_dynamixel_crc(&RxBuff, 13, &crcl, &crch, 0);
                if ((crcl == RxBuff[STAT_HEADER_LEN+9]) && (crcl == RxBuff[STAT_HEADER_LEN+10])) {                                  // crc matches
					if (err != 0) {
                        new_pos = 0;	
						if (err == DynamixelError_e::CRCError) {                                                                  // error was with the transmitted crc
                            read_dyna_pos_IT(id);                                                                                 // retransmit
                        } else {                                                                                                  // malformed message transmitted
                            if (re_trans3 == 0u) {                                                                                 // try the packet once more
                               read_dyna_pos_IT(id);
                               re_trans3 = 1;
                            } else {                                                                                               // twice same error
                               position_readbk = 0;                                                                                // default the readback
                               new_pos = 1;                                                                                        // advance sequence without position as message was wrong
                               re_trans3 = 0;
                        	}						   
                        }						
					} else {
						position_readbk = (RxBuff[STAT_HEADER_LEN+8] << 24) | (RxBuff[STAT_HEADER_LEN+7] << 16) | (RxBuff[STAT_HEADER_LEN+6] << 8) | (RxBuff[STAT_HEADER_LEN+5]);
                        new_pos = 1;                                                                                               // request complete
                    }						
                } else {
                    //HAL_UART_Transmit_IT(&huart1, TxDataIT, 15u, 1);                                                   
                    read_dyna_pos_IT(id);					
                    new_pos = 0;					
                }				
			} else {                                                                                                                /* no match was found */
                uint8_t new_heder_found = 0;
                /* search the buffer for a new start transmission and move the message if found */
				for (int z=STAT_HEADER_LEN+1; z < (FULL_READBK_MSG_LEN-STAT_HEADER_LEN); z++) {                                          /* parse the buffer without the header */
			        if (((RxBuff[z]==0xFF && RxBuff[z+1]==0xFF) && (RxBuff[z+2]==0xFD && RxBuff[z+3]==0x00)) && (RxBuff[z+4]==id)) {     /* check for another header (message partial) */
                        for (int x=z; x <= (FULL_READBK_MSG_LEN-1); x++) {                                                               /* for the remaining message */
                            RxBuff[x-z] = RxBuff[x];                                                                                     /* move the buffer up */                                  
                        }
						_index = (x-z)+1;                                                                                                /* set the index to the end of this new message */
                        new_heder_found = 1;
						break;                                                                                                           /* exit the parse loop */
                    }						
                }
                if (new_heder_found == 0) {                                                                                              /* no header found leave the last 5 bytes in the buffer */
			        _index = STAT_HEADER_LEN;                                                                                          // prepare another 5 byte sequence from the last 5 bytes
				    for (int z=0; z <= (STAT_HEADER_LEN-1); z++) {
                        RxBuff[z] = RxBuff[z+(FULL_READBK_MSG_LEN-5)];                                                                 // shuffle rcv buffer to last 5 chars
                    }
                }
                HAL_UART_Transmit_IT(&huart1, TxDataIT, 15u, 1);	                                                               // retransmit as we got some garbled info			
            }				
		}
	} else {                                                                                                                       // detect the start of a valid message
		RxBuff[_index] = Data;
		_index++;
		if(_index == STAT_HEADER_LEN){                                                                                             // 5 byte header received		
			if (((RxBuff[0]==0xFF && RxBuff[1]==0xFF) && (RxBuff[2]==0xFD && RxBuff[3]==0x00)) && (RxBuff[4]==id)) {              // dynamixel message from the address 0x1 
			    _index = STAT_HEADER_LEN + 1;
			} else {
			    _index = STAT_HEADER_LEN - 1;                                                                                      // prepare another 5 byte sequence if not at start of message
				for (int z=0; z <= (STAT_HEADER_LEN-1); z++) {
                    RxBuff[z] = RxBuff[z+1];                                                                                       // shuffle rcv buffer
                }				
			}
		}	
	}
}
void waitRxInterrupt(){
	//while(1){
	//	if(RxBuff[0] == 0xFF && RxBuff[1]==0xFF)break;
	//}
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}